{
	"story": [
		{
			"chapter": 0,
			"title": "Night Sky",
			"content": "Somewhere in a quiet city, a young man that knows what is right and wrong has trouble on doing the right thing. He also has trouble on becoming who they want to be.\n\nPeople rumored that the person who's desperate in life would see all the stars falling down and shining very bright, even brighter than the sun on a summer day. And that those stars would make all of your wishes come true, even if it was something bad.\n\nRei was asleep on his bed, while gentle music played from an old phone. It was cold and comfy, and Rei was sleeping soundly on the soft mattress. There was a cold breeze waving the curtains, and then stars brighten up his room. It was piercingly bright, although the man wouldn't budge from how tired and snug they were on the bed.\n\nBut in a flash, the stars subsided, and everything felt a little bit changed.\n\nA familiar voice could be heard...\n\n\"Rei... Wake up...\""
		},
		{
			"chapter": 1,
			"title": "The Beginning",
			"content": "The sun shines on the window, birds chirping on the balcony railings. Vines creep the nook and crannies of the bedroom walls, while the morning dew drips from the overgrown flora. The air was fresh and the sky was clear.\n\nIt was a quaint little apartment, small kitchen, living room, and a bathroom. The paintwork was peeling off the walls, and the floorboards were creaking. The furniture was old and worn out, but it was still usable. Some of his items were scattered about the room, food wrappers, clothing, and some books.\n\nA feminine figure rises from the bed, yawning and stretching. It was Rei, though looking a bit feminine despite him being a male. He has a short, stubby and chubby body, with a round face and a small snout. He was a furry, white fur, cat-like features, and a long tail. Truely a sight to behold. Pink and Blue eyes for his Left and Right respectively, and a pair of glasses to help his vision. Well, he also is only wearing underwear.\n\nHe finally gets up from his bed, and walks to the bathroom to wash his face. It felt the same as any other day, doing the same routine in this morning. Water drips from the faucet as the shorter Rei washes his face, and finally looks at the mirror. Shocked by his own appearance, he screams and falls back to the floor.\n\n\"What the hell?!\"\n\nThis wasn't normal. Waking up and having his appearances change by just sleeping was not entirely possible. Hell, why does my apartment look like this? Well, to be honest it was still a mess before this happened, but that's besides the point.\n\nHe stood up from the floor, and inspected his new form, back to front and from head to toe. A slim, short, and gender-bent Rei was staring back at him. Attempts of reality checks proved that it was not a dream.\n\n\"It wouldn't be that bad right?\"\n\nHe starts to reality check the other parts of his body, desperately trying to prove that it is a dream. But that rush eases up after a while.\n\n\"Why does it feel real? Why am I a female? and a furry too?\" He mutters, being a little dissapointed. \"I shouldn't explore myself right now, I need to know what happened here.\" He says as he dusts himself and finishes up the errands in the bathroom."
		},
		{
			"chapter": 2,
			"title": "The Apartment",
			"content": "TBC"
		}
	],
	"errorcodes": [
		{
			"chapter": "1234",
			"title": "Is this thing on?",
			"content": "You aren't supposed to see this. If you are, then something must've gone wrong. Or is it really?"
		}
	]
}
